app/views/wallpapers/index.html.erb

SELECT "wallpapers".* FROM "wallpapers"
---
    <% elsif params[:title] || params[:tag] || params[:image_width] || params[:image_height]%>
      <% @wallpapers.length > 1 ? term = "wallpapers" : term = "wallpaper"%>