app/controllers/wallpapers_controller.rb

  def index
    # Check if we are searching something
    if params[:search]
      @wallpapers = Wallpaper.search(params[:search])
---
SELECT "wallpapers".* FROM "wallpapers"

  def show
    @user = current_user
    @wallpaper = Wallpaper.find(params[:id])
---
SELECT  "wallpapers".* FROM "wallpapers" WHERE "wallpapers"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @wallpaper = Wallpaper.new(wallpaper_params)
    @wallpaper.priority = @wallpaper.get_priority
    @wallpaper.uploader = current_user
    @wallpaper.set_owner_tag_list_on(current_user, :tags, @wallpaper.tag_list)
    @wallpaper.tag_list.clear
    respond_to do |format|
      if @wallpaper.save
---
INSERT INTO "wallpapers" ("title", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_wallpaper
      @wallpaper = Wallpaper.find(params[:id])
---
SELECT  "wallpapers".* FROM "wallpapers" WHERE "wallpapers"."id" = ? LIMIT 1  [["id", 1]]